## CSC 217: Week Two Homework

#### This homework is due at **6:00 PM on Wednesday, Feburary 13th**. Any submissions made after that time will receive no credit.

In [4]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

#### 1. Answer Questions 1 through 5 of part 6 of the classwork. You can work right in the notebook from class if you wish, or create a new notebook (or paste it below). Please copy and paste each question into its own cell with answers below it.

#### 2. Answer Questions 1 through 10 from [here](https://www.kaggle.com/kashnitsky/a1-demo-pandas-and-uci-adult-dataset) below (please copy and paste each question into its own cell with answers below it). I've loaded in the code for you and cleaned it up a bit.

In [3]:
#AdultDataSet
df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data')
df.columns = ['age', 'workingclass', 'fnlwgt', 'education', 'education-num', 'martial-status', 'occupation', 'relationship', 'race', 'sex', 'capital-gain', 'capital-loss', 'hours-per-week', 'native-country', 'salary']
df['salary'] = df['salary'].str.strip()
df['native-country'] = df['native-country'].str.strip()
df.head()

,age,workingclass,fnlwgt,education,education-num,martial-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
1,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
2,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
3,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
4,37,Private,284582,Masters,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,0,0,40,United-States,<=50K

In [6]:
#Question #1:How many men and women (sex feature) are represented in this dataset.
df['sex'].value_counts()
#Anwser: Men ->21789 Women->10771

 Male      21789
 Female    10771
Name: sex, dtype: int64

In [9]:
# Question #2: What is the average age (age feature) of women?
df.groupby('sex')['age'].mean()
#Answer: Average age of women is 37 years old

sex
 Female    36.858230
 Male      39.433567
Name: age, dtype: float64

In [12]:
#Question #3: What is the percentage of German citizens (native-country feature)?
df['native-country'].value_counts(normalize=True)
0.004208*100
#Answer:Germany's percentage of German Citizens is 0.42%

0.4208

In [18]:
#Question #4 and 5: What are the mean and standard deviation of age for those who earn more than 50K per year (salary feature) and those who earn less than 50K per year?
df.groupby('salary')['age'].mean()
#Answer #4: The mean for those who earn more than 50K per year is 44.2%, those who earn less than 50K per year is 36.7%.

salary
<=50K    36.783648
>50K     44.249841
Name: age, dtype: float64

In [19]:
#5 Standard Deviation:
df.groupby('salary')['age'].std()
#Answer: The std of who earns >50K per year is 10.519 and the std for <= to 50K a year is 14.02

salary
<=50K    14.020365
>50K     10.519028
Name: age, dtype: float64

In [21]:
#Question #6:Is it true that people who earn more than 50K have at least high school education? (education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters or Doctorate feature)
df[df['salary'] == '>50K']['education'].value_counts()
#Answer: The statement above is not necessarily true because there are some people who don't have a high school degree and make more than 50K a year, but people with a highschool degree or higher is more likely to earn more than 50 K.

 Bachelors       2221
 HS-grad         1675
 Some-college    1387
 Masters          959
 Prof-school      423
 Assoc-voc        361
 Doctorate        306
 Assoc-acdm       265
 10th              62
 11th              60
 7th-8th           40
 12th              33
 9th               27
 5th-6th           16
 1st-4th            6
Name: education, dtype: int64

In [23]:
#Question #7:Display age statistics for each race (race feature) and each gender (sex feature). Use groupby() and describe(). Find the maximum age of men of Amer-Indian-Eskimo race.
df.groupby('race')['age'].describe()
#Answer: The maximum age of men of Amer-Indian-Eskimo race is 82 years old.

,count,mean,std,min,25%,50%,75%,max
race,,,,,,,,
Amer-Indian-Eskimo,311.0,37.173633,12.447130,17.0,28.0,35.0,45.5,82.0
Asian-Pac-Islander,1039.0,37.746872,12.825133,17.0,28.0,36.0,45.0,90.0
Black,3124.0,37.767926,12.759290,17.0,28.0,36.0,46.0,90.0
Other,271.0,33.457565,11.538865,17.0,25.0,31.0,41.0,77.0
White,27815.0,38.769872,13.782554,17.0,28.0,37.0,48.0,90.0

In [25]:
#Question #8:Among whom is the proportion of those who earn a lot (>50K) greater: married or single men (marital-status feature)? Consider as married those who have a marital-status starting with Married (Married-civ-spouse, Married-spouse-absent or Married-AF-spouse), the rest are considered bachelors.
df[df['salary'] == '>50K']['martial-status'].value_counts()
#Answer: Married Men make greater proportion than 50K.

 Married-civ-spouse       6692
 Never-married             491
 Divorced                  463
 Widowed                    85
 Separated                  66
 Married-spouse-absent      34
 Married-AF-spouse          10
Name: martial-status, dtype: int64

In [26]:
#Question #9: What is the maximum number of hours a person works per week (hours-per-week feature)? How many people work such a number of hours, and what is the percentage of those who earn a lot (>50K) among them?
df[df['hours-per-week'] == df['hours-per-week'].max()].shape
#Answer: The maximum number of hours a person works per week is 85 hours and 15 people work this much.

(85, 15)

In [28]:
df[df['hours-per-week'] == df['hours-per-week'].max()]['salary'].value_counts(normalize=True)
#Answer: The percentage of those who earn a lot (>50K) is 29.4%

<=50K    0.705882
>50K     0.294118
Name: salary, dtype: float64

In [34]:
#Question #10:Count the average time of work (hours-per-week) for those who earn a little and a lot (salary) for each country (native-country). What will these be for Japan?
df[df['native-country'] == 'Japan'].groupby(['native-country', 'salary'])['hours-per-week'].mean()
#Answer: In Japan, people who earn less than 50 K work around 41 hours, and those who earn greater than 50K work about 48 hours.

native-country  salary
Japan           <=50K     41.000000
                >50K      47.958333
Name: hours-per-week, dtype: float64

#### 3. Think of some datasets you might be interested in analyzing and post two below. You can either use the pd.read_table to pull a table off of a page like Wikipedia or pd.read_csv to read a CSV from a site. Get creative! If you're not sure where to start, google 'free datasets' to get a sense of what's out there. Everything is only a search away. If there are datasets you're interested in working with but can't find the data you're looking for or are having trouble finding them

In [51]:
#Popular Names during certain years:
names = pd.read_html('https://www.ssa.gov/oact/babynames/top5names.html')
names

[       0         1         2         3         4         5        6   \
 0     NaN   Females     Males       NaN       NaN       NaN      NaN
 1    Year    Rank 1    Rank 2    Rank 3    Rank 4    Rank 5   Rank 1
 2    2017      Emma    Olivia       Ava  Isabella    Sophia     Liam
 3    2016      Emma    Olivia       Ava    Sophia  Isabella     Noah
 4    2015      Emma    Olivia    Sophia       Ava  Isabella     Noah
 5    2014      Emma    Olivia    Sophia  Isabella       Ava     Noah
 6    2013    Sophia      Emma    Olivia  Isabella       Ava     Noah
 7    2012    Sophia      Emma  Isabella    Olivia       Ava    Jacob
 8    2011    Sophia  Isabella      Emma    Olivia       Ava    Jacob
 9    2010  Isabella    Sophia      Emma    Olivia       Ava    Jacob
 10   2009  Isabella      Emma    Olivia    Sophia       Ava    Jacob
 11   2008      Emma  Isabella     Emily    Olivia       Ava    Jacob
 12   2007     Emily  Isabella      Emma       Ava   Madison    Jacob
 13   2006     Emily      Emma   Madison  Isabella       Ava    Jacob
 14   2005     Emily      Emma   Madison   Abigail    Olivia    Jacob
 15   2004     Emily      Emma   Madison    Olivia    Hannah    Jacob
 16   2003     Emily      Emma   Madison    Hannah    Olivia    Jacob
 17   2002     Emily   Madison    Hannah      Emma    Alexis    Jacob
 18   2001     Emily   Madison    Hannah    Ashley    Alexis    Jacob
 19   2000     Emily    Hannah   Madison    Ashley     Sarah    Jacob
 20   1999     Emily    Hannah    Alexis     Sarah  Samantha    Jacob
 21   1998     Emily    Hannah  Samantha     Sarah    Ashley  Michael
 22   1997     Emily   Jessica    Ashley     Sarah    Hannah  Michael
 23   1996     Emily   Jessica    Ashley     Sarah  Samantha  Michael
 24   1995   Jessica    Ashley     Emily  Samantha     Sarah  Michael
 25   1994   Jessica    Ashley     Emily  Samantha     Sarah  Michael
 26   1993   Jessica    Ashley     Sarah  Samantha     Emily  Michael
 27   1992    Ashley   Jessica    Amanda  Brittany     Sarah  Michael
 28   1991    Ashley   Jessica  Brittany    Amanda  Samantha  Michael
 29   1990   Jessica    Ashley  Brittany    Amanda  Samantha  Michael
 ..    ...       ...       ...       ...       ...       ...      ...
 72   1947     Linda      Mary  Patricia   Barbara    Sandra    James
 73   1946      Mary     Linda  Patricia   Barbara     Carol    James
 74   1945      Mary     Linda   Barbara  Patricia     Carol    James
 75   1944      Mary   Barbara     Linda  Patricia     Carol    James
 76   1943      Mary   Barbara  Patricia     Linda     Carol    James
 77   1942      Mary   Barbara  Patricia     Linda     Carol    James
 78   1941      Mary   Barbara  Patricia     Carol     Linda    James
 79   1940      Mary   Barbara  Patricia    Judith     Betty    James
 80   1939      Mary   Barbara  Patricia     Betty   Shirley   Robert
 81   1938      Mary   Barbara  Patricia     Betty   Shirley   Robert
 82   1937      Mary   Barbara  Patricia   Shirley     Betty   Robert
 83   1936      Mary   Shirley   Barbara     Betty  Patricia   Robert
 84   1935      Mary   Shirley   Barbara     Betty  Patricia   Robert
 85   1934      Mary     Betty   Barbara   Shirley   Dorothy   Robert
 86   1933      Mary     Betty   Barbara   Dorothy      Joan   Robert
 87   1932      Mary     Betty   Barbara   Dorothy      Joan   Robert
 88   1931      Mary     Betty   Dorothy   Barbara      Joan   Robert
 89   1930      Mary     Betty   Dorothy     Helen  Margaret   Robert
 90   1929      Mary     Betty   Dorothy     Helen  Margaret   Robert
 91   1928      Mary     Betty   Dorothy     Helen  Margaret   Robert
 92   1927      Mary   Dorothy     Betty     Helen  Margaret   Robert
 93   1926      Mary   Dorothy     Betty     Helen  Margaret   Robert
 94   1925      Mary   Dorothy     Betty     Helen  Margaret   Robert
 95   1924      Mary   Dorothy     Helen     Betty  Margaret   Robert
 96   1923      Mary   Dorothy     Helen  Margaret     Betty     John
 97   1922      Mary   Dorothy     Helen  Margaret      Ruth     John
 98   1921      Mary   Dorothy     Helen  Margaret      Ruth     John
 99   1920      Mary   Dorothy     Helen  Margaret      Ruth     John
 100  1919      Mary     Helen   Dorothy  Margaret      Ruth     John
 101  1918      Mary     Helen   Dorothy  Margaret      Ruth     John

               7            8            9            10
 0            NaN          NaN          NaN          NaN
 1         Rank 2       Rank 3       Rank 4       Rank 5
 2           Noah      William        James        Logan
 3           Liam      William        Mason        James
 4           Liam        Mason        Jacob      William
 5           Liam        Mason        Jacob      William
 6          Jacob         Liam        Mason      William
 7          Mason        Ethan         Noah      William
 8          Mason      William       Jayden         Noah
 9          Ethan      Michael       Jayden      William
 10         Ethan      Michael    Alexander      William
 11       Michael        Ethan       Joshua       Daniel
 12       Michael        Ethan       Joshua       Daniel
 13       Michael       Joshua        Ethan      Matthew
 14       Michael       Joshua      Matthew        Ethan
 15       Michael       Joshua      Matthew        Ethan
 16       Michael       Joshua      Matthew       Andrew
 17       Michael       Joshua      Matthew        Ethan
 18       Michael      Matthew       Joshua  Christopher
 19       Michael      Matthew       Joshua  Christopher
 20       Michael      Matthew       Joshua     Nicholas
 21         Jacob      Matthew       Joshua  Christopher
 22         Jacob      Matthew  Christopher       Joshua
 23       Matthew        Jacob  Christopher       Joshua
 24       Matthew  Christopher        Jacob       Joshua
 25   Christopher      Matthew       Joshua        Tyler
 26   Christopher      Matthew       Joshua        Tyler
 27   Christopher      Matthew       Joshua       Andrew
 28   Christopher      Matthew       Joshua       Andrew
 29   Christopher      Matthew       Joshua       Daniel
 ..           ...          ...          ...          ...
 72        Robert         John      William      Richard
 73        Robert         John      William      Richard
 74        Robert         John      William      Richard
 75        Robert         John      William      Richard
 76        Robert         John      William      Richard
 77        Robert         John      William      Richard
 78        Robert         John      William      Richard
 79        Robert         John      William      Richard
 80         James         John      William      Richard
 81         James         John      William      Richard
 82         James         John      William      Richard
 83         James         John      William      Richard
 84         James         John      William      Richard
 85         James         John      William      Richard
 86         James         John      William      Richard
 87         James         John      William      Richard
 88         James         John      William      Richard
 89         James         John      William      Richard
 90         James         John      William      Charles
 91          John        James      William      Charles
 92          John        James      William      Charles
 93          John        James      William      Charles
 94          John      William        James      Charles
 95          John      William        James      Charles
 96        Robert      William        James      Charles
 97        Robert      William        James      Charles
 98        Robert      William        James      Charles
 99       William       Robert        James      Charles
 100      William        James       Robert      Charles
 101      William        James       Robert      Charles

 [102 rows x 11 columns]]

In [52]:
divorces = pd.read_html('https://en.wikipedia.org/wiki/Divorce_demography')

[    0                                                  1
 0 NaN  This section needs expansion. You can help by ...,
                                     0                    1  \
 0                             Country  Crude marriage rate
 1                             Albania                  7.8
 2                             Algeria                 10.1
 3                             Armenia                  6.0
 4                           Australia                  4.8
 5                             Austria                  5.1
 6                          Azerbaijan                  9.7
 7                             Bahamas                  6.1
 8                          Bangladesh                  2.9
 9                             Belarus                  9.2
 10                            Belgium                  3.9
 11                            Bermuda                 10.6
 12             Bosnia and Herzegovina                  4.8
 13                             Brazil                  6.6
 14                           Bulgaria                  3.8
 15                             Canada                  4.4
 16                              Chile                  3.3
 17                              China                  9.3
 18                           Colombia                  2.3
 19                         Costa Rica                  5.3
 20                            Croatia                  4.9
 21                               Cuba                  5.2
 22                             Cyprus                  7.5
 23                     Czech Republic                  4.8
 24                            Denmark                  5.4
 25                 Dominican Republic                  4.4
 26                            Ecuador                  5.6
 27                              Egypt                 11.0
 28                        El Salvador                  3.5
 29                            Estonia                  5.2
 ..                                ...                  ...
 76   Saint Vincent and the Grenadines                  5.8
 77                         San Marino                  6.1
 78                       Saudi Arabia                  5.2
 79                             Serbia                  5.1
 80                         Seychelles                 17.4
 81                          Singapore                  6.8
 82                           Slovakia                  5.5
 83                           Slovenia                  3.2
 84                       South Africa                  3.5
 85                        South Korea                  6.4
 86                              Spain                  3.7
 87                          Sri Lanka                  NaN
 88                           Suriname                  4.2
 89                             Sweden                  5.4
 90                        Switzerland                  5.0
 91                              Syria                 10.6
 92                             Taiwan                  NaN
 93                         Tajikistan                 13.5
 94                           Thailand                  5.5
 95                              Tonga                  7.1
 96                Trinidad and Tobago                  6.3
 97                             Turkey                  7.5
 98                            Ukraine                  6.7
 99               United Arab Emirates                  2.8
 100                    United Kingdom                  4.4
 101                     United States                  6.9
 102                           Uruguay                  3.2
 103                        Uzbekistan                  7.8
 104                         Venezuela                  3.3
 105                           Vietnam                  5.7

                       2                         3                 4
 0    Crude divorce rate  % Divorce:marriage ratio  Data Source Year
 1                   1.9                        24         (2016)[2]
 2                   1.6                        16         (2013)[3]
 3                   1.0                        17      (2011)[4][5]
 4                   2.0                        42         (2015)[6]
 5                   1.8                        35         (2016)[2]
 6                   1.5                        15      (2011)[4][5]
 7                   1.0                        16      (2007)[4][5]
 8                   1.0                        34      (2007)[4][5]
 9                   4.1                        45      (2011)[4][5]
 10                  2.1                        54         (2016)[2]
 11                  2.7                        25      (2009)[4][5]
 12                  0.6                        13         (2012)[2]
 13                  1.4                        17         (2009)[7]
 14                  1.5                        39         (2015)[2]
 15                  2.1                        48      (2008)[4][5]
 16                  0.7                        21      (2009)[4][5]
 17                  2.8                        30         (2015)[8]
 18                  0.7                        30         (2007)[9]
 19                  2.5                        47      (2010)[4][5]
 20                  1.7                        35         (2016)[2]
 21                  2.9                        56      (2010)[4][5]
 22                  2.3                        31         (2016)[2]
 23                  2.4                        50         (2016)[2]
 24                  3.0                        56         (2016)[2]
 25                  1.8                        41      (2010)[4][5]
 26                  1.1                        20         (2006)[9]
 27                  1.9                        17      (2010)[4][5]
 28                  0.8                        23         (2006)[9]
 29                  2.6                        52         (2016)[2]
 ..                  ...                       ...               ...
 76                  0.8                        14      (2007)[4][5]
 77                  2.5                        41      (2011)[4][5]
 78                  1.1                        21         (2005)[9]
 79                  1.3                        25         (2016)[2]
 80                  1.9                        11      (2011)[4][5]
 81                  1.9                        28        (2015)[15]
 82                  1.7                        31         (2016)[2]
 83                  1.2                        38         (2016)[2]
 84                  0.6                        17         (2009)[7]
 85                  2.3                        36        (2013)[16]
 86                  2.1                        57         (2016)[2]
 87                 0.15                       NaN              [17]
 88                  1.3                        31      (2007)[4][5]
 89                  2.4                        44         (2016)[2]
 90                  2.0                        40         (2016)[2]
 91                  1.3                        12         (2006)[9]
 92                 2.31                       NaN        (2017)[18]
 93                  1.4                        10      (2009)[4][5]
 94                  1.4                        25         (2005)[9]
 95                  1.2                        17         (2003)[9]
 96                  2.2                        35     (2005)[9][19]
 97                  1.6                        21         (2016)[2]
 98                  2.8                        42      (2010)[4][5]
 99                  0.7                        25        (2005)[20]
 100                 1.8                        39         (2015)[2]
 101                 3.2                        46        (2014)[21]
 102                 NaN                       NaN         (2010)[4]
 103                 1.1                        14    (2006)[22][23]
 104                 1.2                        36         (2006)[4]
 105                 0.8                        14      (2007)[4][5]

 [106 rows x 5 columns],
                                                     0  \
 0      vteLists of countries by population statistics
 1                                              Global
 2                                    (Sub-)continents
 3                                    Intercontinental
 4                                Cities/urban regions
 5                                     Past and future
 6                                  Population density
 7                                   Growth indicators
 8                                  Other demographics
 9                                              Health
 10                           Education and innovation
 11                                           Economic
 12  List of international rankings List of top int...

                                                     1
 0                                                 NaN
 1   Current population Current population (United ...
 2   Africa Asia Europe North America Caribbean Oce...
 3   Americas Arab world Commonwealth of Nations Eu...
 4   National capitals Cities proper Metropolitan a...
 5   Past population (United Nations estimates) Pas...
 6   Current density Past and future population den...
 7   Population growth rate Natural increase Birth ...
 8   Age at first marriage Divorce rate Ethnic and ...
 9   Antiviral medications for pandemic influenza H...
 10  Bloomberg Innovation Index Education Index Int...
 11  Development aid given Official Development Ass...
 12                                                NaN  ]

In [ ]:
divorces = pd.read_html('https://en.wikipedia.org/wiki/Divorce_demography')